# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv9t object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov9
# Task docs: https://docs.ultralytics.com/tasks/detect
# 544 layers, 2128720 parameters, 8.5 GFLOPs

# Parameters
nc: 80 # number of classes
fusion_mode: bifpn
head_channel: 64
# GELAN backbone
backbone:
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]] # 1-P2/4
  - [-1, 1, ELAN1, [32, 32, 16]] # 2
  - [-1, 1, AConv, [64]] # 3-P3/8
  - [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]] # 4
  - [-1, 1, AConv, [96]] # 5-P4/16
  - [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]] # 6
  - [-1, 1, AConv, [128]] # 7-P5/32
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]] # 8
  - [-1, 1, SPPELAN, [128, 64]] # 9

head:
   # [from, repeats, module, args]
  - [4, 1, Conv, [head_channel]]  # 10-P3/8
  - [6, 1, Conv, [head_channel]]  # 11-P4/16
  - [9, 1, Conv, [head_channel]]  # 12-P5/32

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13 P5->P4
  - [[-1, 11], 1, Fusion, [fusion_mode]] # 14
  - [-1, 1, RepNCSPELAN4, [head_channel, 96, 48, 3]] # 15-P4/16
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 16 P4->P3
  - [[-1, 10], 1, Fusion, [fusion_mode]] # 17
  - [-1, 1, RepNCSPELAN4, [head_channel, 64, 32, 3]]  # 18-P3/8

  - [2, 1, Conv, [head_channel, 3, 2]] # 19 P2->P3
  - [[-1, 10, 18], 1, Fusion, [fusion_mode]] # 20
  - [-1, 1, RepNCSPELAN4, [head_channel, 64, 32, 3]]  # 21-P3/8

  - [-1, 1, Conv, [head_channel, 3, 2]] # 22 P3->P4
  - [[-1, 11, 15], 1, Fusion, [fusion_mode]] # 23
  - [-1, 1, RepNCSPELAN4, [head_channel, 96, 48, 3]] # 24-P4/16

  - [-1, 1, Conv, [head_channel, 3, 2]] # 25 P4->P5
  - [[-1, 12], 1, Fusion, [fusion_mode]] # 26
  - [-1, 1, RepNCSPELAN4, [head_channel, 128, 64, 3]] # 27-P5/32

  - [[21, 24, 27], 1, Detect, [nc]]  # Detect(P3, P4, P5)
